app/controllers/charities_controller.rb

SELECT  "charities".* FROM "charities" WHERE "charities"."id" = $1 LIMIT 1  [["id", 16]]
---
  def show
    #a specific charity's page w/info
    p params[:charity_id]
    @charity = Charity.find(params[:id])

SELECT  "disasters".* FROM "disasters" WHERE "disasters"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "charities".* FROM "charities"
---
  def index
    @charities = []
    @disaster = Disaster.find(params[:disaster_id])
    in_area_charities = Charity.all