app/controllers/disasters_controller.rb

SELECT "disasters".* FROM "disasters"
---
  def index
    #home page, feed of all disasters in narrowed map scope
    @disasters = Disaster.all

SELECT  "disasters".* FROM "disasters" WHERE "disasters"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    #a specific disaster with associated charities

    @disaster = Disaster.find(params[:id])